app/views/tasks/index.html.erb

			<% if curr_id == nil || curr_id  != task.organization_id %>
					<strong><%= Organization.find(task.organization_id).name %></strong><br/>
---
SELECT "organizations".* FROM "organizations" INNER JOIN "user_organizations" ON "organizations".id = "user_organizations".organization_id WHERE (("user_organizations".user_id = 1))