app/views/tasks/index.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "user_groups" ON "groups".id = "user_groups".group_id WHERE (("user_groups".user_id = 1))
---
                                        <td><%= task.description %></td>
                                        <td><%= task.group.nil? ? "N/A" : (link_to task.group.first_names_of_people.to_sentence, group_path(task.group))  %></td>