app/views/tasks/show.html.erb

SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = -615449658) LIMIT 1
---
<b>Organization: </b><br/>
<%= Organization.find(@task.organization_id).name %><br/><br/>

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 0) LIMIT 1
---
	<% else %>
	<% group = Group.find(@task.group_id) %>