app/controllers/activations_controller.rb

SELECT "users".* FROM "users" WHERE (perishable_token = 'MDHZV8smr6v8l04saxKi' and updated_at > '2010-10-26 03:46:30.638287') LIMIT 1
---
  def new
    current_navigation :welcome
    if params[:activation_code]
      @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE "users" SET "active" = 't', "crypted_password" = 'a2d6675038979553aeea53a73c3e44e68bc277d22508cabd28db5733563ac4bccb95054e208c664494062c997a6bb0b5274061b14a009a1a3bae24e11596faf0', "password_salt" = 'njH5tUMJlWkGTE5xc-Ul', "perishable_token" = 'HhD84jGvNlFUsFZV54x3', "persistence_token" = '22eb459561c6a364a4ab09e95ffe8d92cb9b0584c8ea898a15f1205495e0fccb5cc5518d3d39d38bdef786407137a9d0c2bc29d8bfe9db283ab0316e02b5809a', "updated_at" = '2010-11-02 05:29:27.862286' WHERE ("users"."id" = 4)
---
  def create
    @user = User.find(params[:id])
    raise Exception if @user.active?
    if @user.activate!(params)
      #year, month, day
      @user.first_name = params[:first_name]
      @user.last_name = params[:last_name]
      @user.save