app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 4) LIMIT 1
---
  def show
    @group = Group.find(params[:id])

SELECT "organizations".* FROM "organizations" WHERE (creator_id = 1)
---
  def new
    @group = Group.new
    if params[:id] == nil   # should not be able to create a new group unless it's thru org
      flash[:error] = "adsfwasdf"
      render "/projects/access_denied"
    else
      @org = Organization.find(params[:id])

INSERT INTO "groups" ("created_at", "name", "organization_id", "updated_at") VALUES ('2010-11-23 03:15:31.533869', 'Rotten Banana', NULL, '2010-11-23 03:15:31.533869')
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def create
    @group = Group.new
    @group.name = params[:name]
    @group.organization_id = params[:organization][:id]

    if @group.save
      #params[:members].each do |member|
      #  @user = User.find(member)
      #  if !@group.users.include? @user
      #    @group.users <<  @user
      #  end
      #end
      org_users = Organization.find(params[:organization][:id]).users