app/controllers/organizations_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE (`tasks`.`id` = 0) LIMIT 1
---
  def show
    @task = Task.find params[:id]