app/controllers/organizations_controller.rb

INSERT INTO "organizations" ("created_at", "creator_id", "description", "name", "updated_at") VALUES ('2010-11-23 03:36:59.472667', 1, 'Blue Organization', 'Blue Organization', '2010-11-23 03:36:59.472667')
---
  def create
    #for now, creator_id is just one but this should be the id of the current user who is creating the organization.
    @org = Organization.new
    @org.name = params[:organization][:name]
    @org.description = params[:organization][:description]
    @org.creator_id = @current_user.id

    if @org.save

SELECT `organizations`.* FROM `organizations` INNER JOIN `user_organizations` ON `organizations`.id = `user_organizations`.organization_id WHERE ((`user_organizations`.user_id = 2))
---
  def index
    @joined_orgs = @current_user.organizations #organizations that the current user is a part of
    @my_orgs = Organization.where("creator_id = ?", @current_user.id) #organizations that the current user created

SELECT `organizations`.* FROM `organizations` WHERE (`organizations`.`id` = 2) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def show
    @org = Organization.find params[:id]

    if !@org.users.include?  @current_user