app/controllers/projects_controller.rb

  def index
    set_of_projs = Set.new
    @current_user.groups.each do |g|
      g.tasks.each do |t|
        set_of_projs.add(t.project)
      end
    end
    @projects = set_of_projs.to_a
---
SELECT `projects`.* FROM `projects`