app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE (`projects`.`organization_id` IS NULL) LIMIT 1
---
  def index
    @org_id = params[:org_id]
    @projects = Project.where(["organization_id = ?", @org_id])

SELECT `organizations`.* FROM `organizations` WHERE (`organizations`.`id` = 1) LIMIT 1
SELECT `groups`.* FROM `groups` WHERE (`groups`.organization_id = 1)
---
  def new
    @org = Organization.find(params[:org_id])

    if @org.creator_id == @current_user.id #only allows the creator of this organization to create a new project
      @project = Project.new
      @groups = @org.groups

INSERT INTO "projects" ("created_at", "description", "name", "organization_id", "updated_at") VALUES ('2010-11-23 08:59:37.952538', 'I need to build an orange tree', 'Build an Orange Tree', 2, '2010-11-23 08:59:37.952538')
---
  def create
    @org_id = params[:org][:id]
    @project = Project.new
    @project.name = params[:project][:name]
    @project.description = params[:project][:description]
    @project.organization_id = @org_id

    if @project.save

SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 1) LIMIT 1
SELECT `groups`.* FROM `groups` WHERE (`groups`.organization_id = 2)
INSERT INTO "tasks" ("created_at", "description", "due", "group_id", "name", "organization_id", "point", "project_id", "status", "updated_at") VALUES ('2010-11-23 09:09:24.332539', 'Planting Orange Seed', '2010-11-23 08:00:00.000000', NULL, 'Plant the orange seed', NULL, 3, 1, 0, '2010-11-23 09:09:24.332539')
---
  def manage
    @task = Task.new
    @id = params[:id]
    @project = Project.find(@id)
    @org = @project.organization
    @groups = @org.groups

    if @org.creator_id == @current_user.id #only allows the creator of this organization to create a new project
      if params[:commit]
        @task = Task.new
        @task.name = params[:task][:name]
        @task.description = params[:task][:description]
        @task.point = params[:task][:point]
        @task.due = Date.new(params[:start_date][:year].to_i, params[:start_date][:month].to_i , params[:start_date][:day].to_i)
        @task.project_id = @id
        if @task.save