app/controllers/tasks_controller.rb

  def new
    current_navigation :tasks
    @task = Task.new
    @project = Project.find(params[:id])
    @org = @project.organization
    @groups = @org.groups
---
SELECT "groups".* FROM "groups" WHERE (organization_id = 1 )
SELECT "organizations".* FROM "organizations" WHERE (organization_id = 1 )

  def create
    @task = Task.create(params[:task])
---
INSERT INTO "tasks" ("created_at", "description", "due", "group_id", "name", "organization_id", "point", "project_id", "status", "updated_at") VALUES ('2010-11-23 08:04:46.902731', 'Paint Blue', '2010-03-22 07:00:00.000000', NULL, 'Paint Blue', 1, 1, NULL, 0, '2010-11-23 08:04:46.902731')

  def show
    # TODO test this
    @task = Task.find(params[:id])
    can_view = @task.can_user_access?(@current_user)
    unless can_view
      flash[:error] = 'Access Denied'
      redirect_to :controller => root_url
    end

    current_navigation :tasks
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."id" = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1