app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if (params[:oauth_provider] || params[:code] || params[:oauth_token])
      @user.save do |result|
        if result
          if @user.access_token.type == "FacebookToken"
            profile = JSON.parse(@user.access_token.get("/me"))
            @user.email = profile["email"]
            @user.first_name = profile["first_name"]
---
INSERT INTO "users" ("active", "created_at", "crypted_password", "email", "first_name", "last_name", "password_salt", "perishable_token", "persistence_token", "phone_number", "sms_enabled", "updated_at") VALUES (NULL, '2010-11-23 03:02:18.542210', NULL, 'spitfire67@berkeley.edu', NULL, NULL, NULL, 'Ra_VJYwDVSTjnByi7HkV', 'cb5939c4471bf6ebc01047fc0e2b7c5e747688c55ece8622fe68fb3d82667faaaa89520ad3bf4dc04a0c8497ec29ac6279bdbc7b7ec341ec1d62cf25d5fd1a2b', NULL, 'f', '2010-11-23 03:02:18.542210')
SELECT `users`.`id` FROM `users` WHERE (LOWER(`users`.`email`) = LOWER('supersonic_297@berkeley.edu')) LIMIT 1

  def update
    @current_user.first_name = params[:user][:first_name]
    @current_user.last_name = params[:user][:last_name]
    @current_user.save(false)
---
UPDATE "users" SET "perishable_token" = 'L9hDqgf2RCZnx0tIYoSy', "phone_number" = '440-554-8235', "sms_enabled" = 't', "updated_at" = '2010-11-22 22:40:01.981198' WHERE ("users"."id" = 1)