app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`active`, `created_at`, `crypted_password`, `email`, `first_name`, `last_name`, `password_salt`, `perishable_token`, `persistence_token`, `phone_number`, `sms_enabled`, `updated_at`) VALUES (NULL, '2010-11-22 09:54:10', 'a3c0de91b6e1b3816956036e815897a2019904fea5a23b3e00461cb2aa53255db27f3fe0162fc8dbc6867a5e8222e54e309415ed11652c365475f5f8979462ee', 'spitfire67@berkeley.edu', NULL, NULL, 'Zr_yjsxQ7VG3XOgCg1H9', 'rzMb3dcbShMGmlYiZ3LP', 'd9da0da7ed1d96c5491e74b776bfe8ec23fe6d19754fc0794d29ddcf1b85e24d951a29b678f5670aaa48525a1562df035fb3e8140aadd077b244ac523162aa55', NULL, 0, '2010-11-22 09:54:10')
---
  def create
    @user_session = UserSession.new(params[:user_session])
    @user_session.save do |result|