app/controllers/users_controller.rb

  def update
    if params[:user][:sms_enabled] == "1"
      @current_user.sms_enabled = true
    end
    @current_user.phone_number = params[:user][:phone_number]
    @current_user.save
    if @current_user.errors.any?
---
SELECT "users".* FROM "users" WHERE ("users"."phone_number" = '2169269443') LIMIT 1