app/views/organizations/index.html.erb

					<% else %>
							<% owner = User.find(org.id) %>
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1