app/views/layouts/_header.html.erb

SELECT COUNT(*) AS count_id FROM `organizations` INNER JOIN `user_organizations` ON `organizations`.id = `user_organizations`.organization_id WHERE ((`user_organizations`.user_id = 1))
SELECT `organizations`.* FROM `organizations` INNER JOIN `user_organizations` ON `organizations`.id = `user_organizations`.organization_id WHERE ((`user_organizations`.user_id = 2))
---
		 	<% else %>
                                <% if @current_user.organizations.size == 1 %>